tap "aquaproj/aqua"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/services"
tap "rhysd/actionlint", "https://github.com/rhysd/actionlint"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "python@3.12"
brew "ansible"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "awscli"
brew "bat"
brew "boost"
brew "glib"
brew "cairo"
brew "carthage"
brew "cocoapods"
brew "docutils"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "eza"
brew "fd"
brew "unbound", restart_service: true
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "gobject-introspection"
brew "httpie"
brew "shared-mime-info"
brew "libheif"
brew "liblqr"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "lft"
brew "libfido2"
brew "mas"
brew "mise"
brew "mysql"
brew "ncdu"
brew "nghttp2"
brew "nmap"
brew "pinentry-mac"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "starship"
brew "tcl-tk"
brew "tree"
brew "watchman"
brew "yt-dlp"
brew "aquaproj/aqua/aqua"
brew "rhysd/actionlint/actionlint"
cask "1password"
cask "android-file-transfer"
cask "android-studio"
cask "arc"
cask "bettertouchtool"
cask "brave-browser"
cask "daisydisk"
cask "dbngin"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox@developer-edition"
cask "flux"
cask "font-blex-mono-nerd-font"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans-jp"
cask "font-ibm-plex-serif"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "gyazo"
cask "jump-desktop-connect"
cask "kap"
cask "karabiner-elements"
cask "keka"
cask "keyboardcleantool"
cask "keycastr"
cask "kindle"
cask "malwarebytes"
cask "microsoft-edge"
cask "ngrok"
cask "orbstack"
cask "raycast"
cask "slack"
cask "spotify"
cask "steam"
cask "tableplus"
cask "temurin@17"
cask "the-unarchiver"
cask "timemachineeditor"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "whisky"
cask "zed"
cask "zen-browser"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Disk Speed Test", id: 425264550
mas "Divvy", id: 413857545
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixave", id: 924891282
mas "Whisper Transcription", id: 1668083311
mas "WiFi Signal", id: 525912054
mas "Xcode", id: 497799835
vscode "1natsu.insert-br-tag"
vscode "42crunch.vscode-openapi"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "biomejs.biome"
vscode "bmalehorn.vscode-fish"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "ionutvmi.path-autocomplete"
vscode "kaiwood.indentation-level-movement"
vscode "kamikillerto.vscode-colorize"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "pomber.git-file-history"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "romanpeshkov.vscode-text-tables"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "ryu1kn.partial-diff"
vscode "satokaz.vscode-bs-ctrlchar-remover"
vscode "shardulm94.trailing-spaces"
vscode "simonsiefke.svg-preview"
vscode "spywhere.guides"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "taoxin.vanjs-importtag"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.codetour"
vscode "vue.volar"
vscode "wesbos.theme-cobalt2"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
