tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "rhysd/actionlint", "https://github.com/rhysd/actionlint"
brew "webp"
brew "asdf"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "boost"
brew "glib"
brew "python@3.9"
brew "carthage"
brew "ruby"
brew "cocoapods"
brew "direnv"
brew "folly"
brew "edencommon"
brew "exa"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libarchive"
brew "libass"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "httpie"
brew "hub"
brew "shared-mime-info"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "lft"
brew "mas"
brew "mysql"
brew "ncdu"
brew "nghttp2"
brew "node"
brew "openblas"
brew "pinentry-mac"
brew "python@3.10"
brew "python@3.8"
brew "starship"
brew "thefuck"
brew "tree"
brew "watchman"
brew "youtube-dl"
brew "rhysd/actionlint/actionlint"
cask "1password"
cask "alfred"
cask "android-file-transfer"
cask "android-studio"
cask "authy"
cask "bartender"
cask "bettertouchtool"
cask "betterzip"
cask "brave-browser"
cask "carbon-copy-cloner"
cask "daisydisk"
cask "dbngin"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox-developer-edition"
cask "flux"
cask "font-fira-code"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "google-earth-pro"
cask "google-japanese-ime"
cask "gyazo"
cask "iterm2"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "keycastr"
cask "kindle"
cask "logitech-options"
cask "malwarebytes"
cask "microsoft-edge"
cask "multipass"
cask "ngrok"
cask "notion"
cask "parallels"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "slack"
cask "spotify"
cask "steam"
cask "suspicious-package"
cask "tableplus"
cask "temurin8"
cask "the-unarchiver"
cask "timemachineeditor"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Disk Speed Test", id: 425264550
mas "Divvy", id: 413857545
mas "GarageBand", id: 682658836
mas "GIF Brewery 3", id: 1081413713
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixave", id: 924891282
mas "PopClip", id: 445189367
mas "Whisper", id: 1668083311
mas "WiFi Signal", id: 525912054
mas "WinArchiver Lite", id: 414855915
mas "Xcode", id: 497799835
