oh-my-fish/plugin-balias
edc/bass
0rax/fish-bd
oh-my-fish/theme-bobthefish
brgmnn/fish-docker-compose
fisherman/fzf
fisherman/getopts
decors/fish-ghq
fisherman/spin
fisherman/z
