edc/bass
0rax/fish-bd
oh-my-fish/theme-bobthefish
brgmnn/fish-docker-compose
decors/fish-docker-machine
fisherman/fzf
fisherman/getopts
decors/fish-ghq
fisherman/spin
jethrokuan/z
FabioAntunes/fish-nvm
tuvistavie/fish-ssh-agent
